Autodesk.Revit.DB.Lighting.LightGroupManager.CreateGroup(System.String)
Create a new LightGroup object with the given name
name:
The name to use for the new LightGroup object
Returns:
The new LightGroup object that was created
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name is not valid because it is not unique within this LightGroupManager
-or-
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013